## **[MySQL BETWEEN operator](https://www.mysqltutorial.org/mysql-between)**

Use MySQL BETWEEN operator to determine whether a value is in a range of values.

In [1]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
from IPython.display import Image, SVG

from sqlalchemy_utils import database_exists, create_database
from sqlalchemy import create_engine, inspect, MetaData, text
from sqlalchemy_schemadisplay import create_schema_graph
import pymysql

pd.set_option(
    'display.max_columns', None,
    'expand_frame_repr', True,
    # 'max_rows', 10, 
    'display.max_colwidth', None,
    'display.max_rows', 10,
    # 'precision', 2,
    # 'width', 45
)

pd.set_option('display.width', 65)

In [2]:
connect_args={'ssl':{'fake_flag_to_enable_tls': True}}

engine = create_engine('mysql+pymysql://namlq:abc123@localhost/classicmodels',
                       connect_args=connect_args, echo=False
                         )
inspector = inspect(engine)

### Introduction to MySQL BETWEEN operator

In [3]:
string = '''
SELECT
    15 BETWEEN 10 AND 20,
    15 BETWEEN 20 AND 30,
    15 NOT BETWEEN 10 AND 20;
'''

pd.read_sql(string, engine)

,15 BETWEEN 10 AND 20,15 BETWEEN 20 AND 30,15 NOT BETWEEN 10 AND 20
0,1,0,0

### MySQL BETWEEN operator examples

#### 1) Using MySQL BETWEEN with number

In [4]:
string = '''
SELECT productCode, productName, buyPrice
FROM products
WHERE
    buyPrice BETWEEN 90 AND 100
    # buyPrice >= 90 AND buyPrice <= 100
;
'''

df1 = pd.read_sql(string, engine)

In [5]:
df2 = (
    pd.read_sql_table('products', engine)
    .query('90 <= buyPrice <= 100')
    [['productCode', 'productName', 'buyPrice']]
    .reset_index(drop=True)
)

In [6]:
df1.equals(df2)

True

In [7]:
df1

  productCode                           productName  buyPrice
0    S10_1949              1952 Alpine Renault 1300     98.58
1    S10_4698  2003 Harley-Davidson Eagle Drag Bike     91.02
2    S12_1099                     1968 Ford Mustang     95.34
3    S12_1108                     2001 Ferrari Enzo     95.59
4    S18_1984                      1995 Honda Civic     93.89
5    S18_4027                 1970 Triumph Spitfire     91.92
6    S24_3856               1956 Porsche 356A Coupe     98.30

In [8]:
string = '''
SELECT productCode, productName, buyPrice
FROM products
WHERE
    buyPrice NOT BETWEEN 20 AND 100
    # buyPrice < 20 OR buyPrice > 100
;'''

pd.read_sql(string, engine)

  productCode                          productName  buyPrice
0    S10_4962               1962 LanciaA Delta 16V    103.42
1    S18_2238       1998 Chrysler Plymouth Prowler    101.51
2    S24_2840  1958 Chevy Corvette Limited Edition     15.91
3    S24_2972              1982 Lamborghini Diablo     16.24

In [9]:
(pd.read_sql_table('products', engine)
 .query('buyPrice < 20 or buyPrice > 100')
 [['productCode', 'productName', 'buyPrice']]
 .reset_index(drop=True)
)

  productCode                          productName  buyPrice
0    S10_4962               1962 LanciaA Delta 16V    103.42
1    S18_2238       1998 Chrysler Plymouth Prowler    101.51
2    S24_2840  1958 Chevy Corvette Limited Edition     15.91
3    S24_2972              1982 Lamborghini Diablo     16.24

#### 2) Using MySQL BETWEEN operator with dates

In [10]:
string = '''
SELECT orderNumber, requiredDate, status
FROM orders
WHERE requiredDate BETWEEN
    CAST('2003-01-01' AS DATE) AND
    CAST('2003-01-31' AS DATE);
'''

pd.read_sql(string, engine)

   orderNumber requiredDate   status
0        10100   2003-01-13  Shipped
1        10101   2003-01-18  Shipped
2        10102   2003-01-18  Shipped

In [11]:
(pd.read_sql_table('orders', engine)
 .query("requiredDate.between('2003-01-13', '2003-01-18')")
 # .query("'2003-01-13' <= requiredDate <= '2003-01-18'")
 [['orderNumber', 'requiredDate', 'status']]
)

   orderNumber requiredDate   status
0        10100   2003-01-13  Shipped
1        10101   2003-01-18  Shipped
2        10102   2003-01-18  Shipped